backend/app/models/project.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "user_projects" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["project_id", 1], ["created_at", "2019-02-01 13:30:31.151123"], ["updated_at", "2019-02-01 13:30:31.151123"]]
---
  def assign_users_to_project(id)
    user = User.where(id: id).first
    return errors.add(:user, 'User does not exist') if user.blank?

    users << user if users.where(id: id).blank?