backend/app/controllers/dashboard_controller.rb

  def data
  	array = []
  	if project_params[:by_user]
	  	User.where(admin: false).left_joins(:todos).includes(:todos).distinct.each do |user|
	  		array << { "name" => user.email, "todos" => user.todos.group_by(&:status) }
	  	end
  	else
      condition = project_params[:project_id].present? ? Project.where(id: project_params[:project_id
      ]) : Project.all
  		condition.left_joins(:todos).includes(:todos).distinct.each do |project|
	  		array << { "name" => project.name, "todos" => project.todos.group_by(&:status) }
---
SELECT "user_todos".* FROM "user_todos" WHERE "user_todos"."user_id" IN (?, ?, ?, ?)  [["user_id", 2], ["user_id", 3], ["user_id", 4], ["user_id", 5]]
SELECT DISTINCT "users".* FROM "users" LEFT OUTER JOIN "user_todos" ON "user_todos"."user_id" = "users"."id" LEFT OUTER JOIN "todos" ON "todos"."id" = "user_todos"."todo_id" WHERE "users"."admin" = ?  [["admin", 0]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" IN (?, ?)  [["project_id", 1], ["project_id", 2]]
SELECT "users".* FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]
SELECT DISTINCT "projects".* FROM "projects" LEFT OUTER JOIN "todos" ON "todos"."project_id" = "projects"."id"
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = ?  [["project_id", 1]]

  def user_data
  	array = []
  	User.where(admin: false, id: current_user.id).left_joins(:todos).includes(:todos).distinct.each do |user|
  		array << { "email" => user.email, "todos" => user.todos.group_by(&:status) }
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" IN (?, ?, ?)  [["id", 1], ["id", 4], ["id", 5]]
SELECT DISTINCT "users".* FROM "users" LEFT OUTER JOIN "user_todos" ON "user_todos"."user_id" = "users"."id" LEFT OUTER JOIN "todos" ON "todos"."id" = "user_todos"."todo_id" WHERE "users"."admin" = ? AND "users"."id" = ?  [["admin", 0], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "admin@minijira.com"], ["LIMIT", 1]]
SELECT "user_todos".* FROM "user_todos" WHERE "user_todos"."user_id" = ?  [["user_id", 2]]