backend/app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Advisory Board Campaign"], ["description", "fff"], ["created_at", "2019-02-01 13:51:06.091260"], ["updated_at", "2019-02-01 13:51:06.091260"]]

  def users
    @users = Project.find(params[:project_id]).users
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "user_projects" ON "users"."id" = "user_projects"."user_id" WHERE "user_projects"."project_id" = ?  [["project_id", 1]]

  def todos
    @todos = Project.find(params[:project_id]).todos
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = ?  [["project_id", 1]]

  def update
    if @project.update_with_users(params)
---
UPDATE "projects" SET "name" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["name", "Advisory Board Campaign"], ["updated_at", "2019-02-01 10:58:13.968269"], ["id", 1]]