backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."admin" = ?  [["admin", 0]]
---
  def index
  	# Returns all the developers
  	users = User.where(admin: false)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    user_project = UserProject.where(user_id: params[:id], project_id: params[:project_id]).first
    user_project.destroy if user_project.present?